/*
********************************************************************************************************
文件名：bsp_sys.c
功  能：初始化所有外设
*********************************************************************************************************
*/

#include "bsp_sys.h"

void STM32_System_Init(void)
{	
	//STM32内部初始化
	Delay_Init(72);        //滴答时钟初始化
	LED_GPIO_Config();     //LED初始化
    my_usart_init(115200); //串口初始化
	
	//外接设备初始化

	MOTO_GPIO_Config();    //电机驱动IO配置
	TIM8_PWM(100,36);      //PWM频率初始化20KHz
 // Find_IO_Init();
	Delay_ms(100);         //等待初始化完成
	
}


